Datastax Enterprise Training:

Day - 1
-------



Remove Ads
    SP MO  
Welcome to Datastax:

Day2:

[admin@dse ~]$ cat /etc/rocky-release
Rocky Linux release 9.6 (Blue Onyx)
[admin@dse ~]$


[admin@dse ~]$ java -version
openjdk version "1.8.0_472"
OpenJDK Runtime Environment (build 1.8.0_472-b08)
OpenJDK 64-Bit Server VM (build 25.472-b08, mixed mode)
[admin@dse ~]$ echo $JAVA_HOME
/usr/lib/jvm/java-1.8.0-openjdk-1.8.0.472.b08-1.el9.x86_64
[admin@dse ~]$

[admin@dse ~]$ sudo alternatives --config java
[sudo] password for admin:

There is 1 program that provides 'java'.

  Selection    Command
-----------------------------------------------
*+ 1           java-1.8.0-openjdk.x86_64 (/usr/lib/jvm/java-1.8.0-openjdk-1.8.0.472.b08-1.el9.x86_64/jre/bin/java)

Enter to keep the current selection[+], or type selection number: 1
[admin@dse ~]$

[admin@dse ~]$ rpm -qa|grep libaio
libaio-0.3.111-13.el9.x86_64
[admin@dse ~]$

[admin@dse ~]$ ls
dse-5.1.48-bin.tar.gz
[admin@dse ~]$ id admin
uid=1000(admin) gid=1000(admin) groups=1000(admin),10(wheel)
[admin@dse ~]$ sudo useradd cassandra
[sudo] password for admin:
[admin@dse ~]$ sudo passwd cassandra
Changing password for user cassandra.
New password:
BAD PASSWORD: The password contains the user name in some form
Retype new password:
passwd: all authentication tokens updated successfully.
[admin@dse ~]$

[cassandra@dse ~]$ ls
dse-5.1.48-bin.tar.gz
[cassandra@dse ~]$ whoami
cassandra
[cassandra@dse ~]$ echo $JAVA_HOME
/usr/lib/jvm/java-1.8.0-openjdk-1.8.0.472.b08-1.el9.x86_64
[cassandra@dse ~]$ tar -xzf dse-5.1.48-bin.tar.gz
[cassandra@dse ~]$ ls
dse-5.1.48  dse-5.1.48-bin.tar.gz



[cassandra@dse ~]$ ln -s dse-5.1.48 dse
[cassandra@dse ~]$ ll
total 916132
lrwxrwxrwx.  1 cassandra cassandra        10 Dec  4 10:00 dse -> dse-5.1.48
drwxr-xr-x. 10 cassandra cassandra      4096 Mar 12  2025 dse-5.1.48
-rw-r--r--.  1 cassandra cassandra 938114780 Dec  4 09:45 dse-5.1.48-bin.tar.gz
[cassandra@dse ~]$


[cassandra@dse ~]$ nano .bashrc
[cassandra@dse ~]$ cat .bashrc
# .bashrc

# Source global definitions
if [ -f /etc/bashrc ]; then
        . /etc/bashrc
fi

# User specific environment
if ! [[ "$PATH" =~ "$HOME/.local/bin:$HOME/bin:" ]]
then
    PATH="$HOME/.local/bin:$HOME/bin:$PATH"
fi
export PATH

export DSE_HOME=/home/cassandra/dse
export PATH=/home/cassandra/dse/bin:$PATH

# Uncomment the following line if you don't like systemctl's auto-paging feature:
# export SYSTEMD_PAGER=

# User specific aliases and functions
if [ -d ~/.bashrc.d ]; then
        for rc in ~/.bashrc.d/*; do
                if [ -f "$rc" ]; then
                        . "$rc"
                fi
        done
fi

unset rc
[cassandra@dse ~]$

[cassandra@dse ~]$ source .bashrc
[cassandra@dse ~]$ echo $DSE_HOME
/home/cassandra/dse
[cassandra@dse ~]$


edit cassandra.yaml file:
[cassandra@dse ~]$ nano dse/resources/cassandra/conf/cassandra.yaml
[cassandra@dse ~]$ cat dse/resources/cassandra/conf/cassandra.yaml |grep -i cluster_name
cluster_name: 'tcscluster'


[cassandra@dse ~]$ cat dse/resources/cassandra/conf/cassandra.yaml |grep -i listen_address
# Set listen_address OR listen_interface, not both.
# Setting listen_address to 0.0.0.0 is always wrong.
listen_address: localhost
# Set listen_address OR listen_interface, not both. Interfaces must correspond
# Leaving this blank will set it to the same value as listen_address
# the listen_address, allowing nodes to communicate in both
# Leaving rpc_address blank has the same effect as on listen_address
# Note that unlike listen_address, you can specify 0.0.0.0, but you must also
[cassandra@dse ~]$ cat dse/resources/cassandra/conf/cassandra.yaml |grep -i rpc_address
# same as the rpc_address. The port however is different and specified below.
# Set rpc_address OR rpc_interface, not both.
# Leaving rpc_address blank has the same effect as on listen_address
# set broadcast_rpc_address to a value other than 0.0.0.0.
rpc_address: 10.0.26.1
# Set rpc_address OR rpc_interface, not both. Interfaces must correspond
# rpc_address. If rpc_address is set to 0.0.0.0, broadcast_rpc_address must
# broadcast_rpc_address: 1.2.3.4
[cassandra@dse ~]$ cat dse/resources/cassandra/conf/cassandra.yaml |grep -i seeds
          # seeds is actually a comma-delimited list of addresses.
          - seeds: "127.0.0.1"
# Probability cassandra will Gossip with one of the seeds during each round of gossip
[cassandra@dse ~]$


Create /var/lib/cassandra directory:

[admin@dse ~]$ sudo mkdir -p /var/lib/cassandra
[sudo] password for admin:
[admin@dse ~]$ ls -ld /var/lib/cassandra/
drwxr-xr-x. 2 root root 6 Dec  4 10:37 /var/lib/cassandra/
[admin@dse ~]$ sudo chown cassandra:cassandra  /var/lib/cassandra
[admin@dse ~]$ ls -ld /var/lib/cassandra/
drwxr-xr-x. 2 cassandra cassandra 6 Dec  4 10:37 /var/lib/cassandra/
[admin@dse ~]$


[admin@dse ~]$ sudo mkdir -p /var/log/cassandra
[admin@dse ~]$ sudo chown cassandra:cassandra  /var/log/cassandra
[admin@dse ~]$ ls -ld /var/log/cassandra/
drwxr-xr-x. 2 cassandra cassandra 6 Dec  4 10:39 /var/log/cassandra/
[admin@dse ~]$


[cassandra@dse ~]$ which dse
~/dse/bin/dse
[cassandra@dse ~]$ dse cassandra -f



 Editable Link  Share Link
Words: 599 | Chars: 5081 | Views: 3
Last Updated: 5 Seconds ago
Privacy  Terms  Contact Us  About Us

Day 4:

[cassandra@dse conf]$ pwd
/home/cassandra/dse/resources/cassandra/conf
[cassandra@dse conf]$


cqlsh> consistency
Current consistency level is ONE.
cqlsh> consistency two
Consistency level set to TWO.
cqlsh> consistency
Current consistency level is TWO.
cqlsh> consistency quorum
Consistency level set to QUORUM.
cqlsh> consistency
Current consistency level is QUORUM.
cqlsh>

cqlsh> consistency
Current consistency level is ONE.
cqlsh> consistency two
Consistency level set to TWO.
cqlsh> consistency
Current consistency level is TWO.
cqlsh> consistency quorum
Consistency level set to QUORUM.
cqlsh> consistency
Current consistency level is QUORUM.
cqlsh>

Day 4:

[cassandra@dse conf]$ pwd
/home/cassandra/dse/resources/cassandra/conf
[cassandra@dse conf]$


cqlsh> consistency
Current consistency level is ONE.
cqlsh> consistency two
Consistency level set to TWO.
cqlsh> consistency
Current consistency level is TWO.
cqlsh> consistency quorum
Consistency level set to QUORUM.
cqlsh> consistency
Current consistency level is QUORUM.
cqlsh>

cqlsh> consistency
Current consistency level is ONE.
cqlsh> consistency two
Consistency level set to TWO.
cqlsh> consistency
Current consistency level is TWO.
cqlsh> consistency quorum
Consistency level set to QUORUM.
cqlsh> consistency
Current consistency level is QUORUM.
cqlsh>


CREATE KEYSPACE excalibur
WITH REPLICATION = {
  'class' : 'NetworkTopologyStrategy',
  'replication_factor' : 3
};

cqlsh:system> CREATE KEYSPACE excalibur WITH REPLICATION = {   'class' : 'SimpleStrategy',   'replication_factor' : 3 };
cqlsh:system>

cqlsh:system> use excalibur;

cqlsh:excalibur> create table orders (ordid int primary key, custname text, orderval float );
cqlsh:excalibur>

cqlsh:excalibur> insert into orders (ordid, custname, orderval) values (10
, 'John', 55.3);
cqlsh:excalibur> select * From orders;

 ordid | custname | orderval
-------+----------+----------
    10 |     John |     55.3

(1 rows)
cqlsh:excalibur>


cqlsh:excalibur> select * from orders where custname='John' allow filtering;

 ordid | custname | orderval
-------+----------+----------
    10 |     John |     55.3

(1 rows)
cqlsh:excalibur> select * from orders where ordid=20;

 ordid | custname | orderval
-------+----------+----------
    20 |     Kyle |     54.3

(1 rows)
cqlsh:excalibur>

Day - 5
----------

cqlsh:excalibur> create index myidx on orders (custname);

cqlsh:excalibur> select * From orders where custname = 'John';

 ordid | custname | orderval
-------+----------+----------
    10 |     John |     55.3

(1 rows)
cqlsh:excalibur>

cqlsh:excalibur> select * from orders;

 ordid | custname | orderval
-------+----------+----------
    10 |     John |     55.3
    20 |     Kyle |     54.3

(2 rows)
cqlsh:excalibur> delete orderval from orders where ordid = 10;
cqlsh:excalibur> select * from orders;

 ordid | custname | orderval
-------+----------+----------
    10 |     John |     null
    20 |     Kyle |     54.3

(2 rows)
cqlsh:excalibur> delete from orders where ordid = 10;
cqlsh:excalibur> select * from orders;

 ordid | custname | orderval
-------+----------+----------
    20 |     Kyle |     54.3

(1 rows)
cqlsh:excalibur>

Automic transaction using Apply:

cqlsh:excalibur> select * from orders;

 ordid | custname | orderval
-------+----------+----------
    10 |      Kim |       72
    30 |     Brad |     17.5
    20 |     Kyle |     54.3
    40 |     John |     34.7

(4 rows)
cqlsh:excalibur> create table test (id int, name text, primary key (id) );

cqlsh:excalibur> insert into test (id, name) values  (1, 'aa');
cqlsh:excalibur> insert into test (id, name) values  (2,'bbb')
             ... ;
cqlsh:excalibur> insert into test (id, name) values  (3,'cc') ;
cqlsh:excalibur> select * from test;

 id | name
----+------
  1 |   aa
  2 |  bbb
  3 |   cc

(3 rows)
cqlsh:excalibur> select * from orders;

 ordid | custname | orderval
-------+----------+----------
    10 |      Kim |       72
    30 |     Brad |     17.5
    20 |     Kyle |     54.3
    40 |     John |     34.7

(4 rows)
cqlsh:excalibur> begin batch
             ... insert into test (id, name) values (4, 'd');
             ... delete address from orders where ordid = 20;
             ... apply batch;
InvalidRequest: Error from server: code=2200 [Invalid query] message="Undefined column name address"
cqlsh:excalibur> select * from test;

 id | name
----+------
  1 |   aa
  2 |  bbb
  3 |   cc

(3 rows)
cqlsh:excalibur>


enable authentication:

in dse.yaml file:

[cassandra@dse conf]$ vi /home/cassandra/dse/resources/dse/conf/dse.yaml
[cassandra@dse conf]$


authentication_options:
     enabled: true
     default_scheme: internal
#     allow_digest_with_kerberos: true
#     plain_text_without_ssl: warn
     transitional_mode: disabled
#     other_schemes:
#     scheme_permissions: false



role_management_options:
     mode: internal
#     stats: false
#     mode_by_authentication:
#         internal:
#         ldap:
#         kerberos:


and Restart cassandra service

Connect to cassandra with autehntication:

[cassandra@dse conf]$ cqlsh 10.0.26.1  -u cassandra
Password:
Connected to tcscluster at 10.0.26.1:9042.
[cqlsh 5.0.1 | DSE 5.1.48 | CQL spec 3.4.4 | DSE protocol v1]
Use HELP for help.
cassandra@cqlsh> describe keyspaces

system_auth    dse_leases          system_distributed  dse_perf
system_schema  dse_insights        system              system_traces
dse_system     dse_insights_local  excalibur           dse_security

cassandra@cqlsh> use excalibur
   ... ;
cassandra@cqlsh:excalibur> describe tables;

orders  test

cassandra@cqlsh:excalibur> select * from test;

 id | name
----+------
  1 |   aa
  2 |  bbb
  3 |   cc

(3 rows)
cassandra@cqlsh:excalibur>


